frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l8/include/component/iisc.h
/**
 * \file
 *
 * \brief Component description for IISC
 *
 * Copyright (c) 2016 Atmel Corporation,
 *                    a wholly owned subsidiary of Microchip Technology Inc.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the Licence at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * \asf_license_stop
 *
 */

#ifndef _SAM4L_IISC_COMPONENT_
#define _SAM4L_IISC_COMPONENT_

/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR IISC */
/* ========================================================================== */
/** \addtogroup SAM4L_IISC Inter-IC Sound (I2S) Controller */
/*@{*/

#define IISC_I7560
#define REV_IISC                    0x100

/* -------- IISC_CR : (IISC Offset: 0x00) ( /W 32) Control Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t RXEN:1;           /*!< bit:      0  Receive Enable                     */
    uint32_t RXDIS:1;          /*!< bit:      1  Receive Disable                    */
    uint32_t CKEN:1;           /*!< bit:      2  Clocks Enable                      */
    uint32_t CKDIS:1;          /*!< bit:      3  Clocks Disable                     */
    uint32_t TXEN:1;           /*!< bit:      4  Transmit Enable                    */
    uint32_t TXDIS:1;          /*!< bit:      5  Transmit Disable                   */
    uint32_t :1;               /*!< bit:      6  Reserved                           */
    uint32_t SWRST:1;          /*!< bit:      7  Software Reset                     */
    uint32_t :24;              /*!< bit:  8..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} IISC_CR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define IISC_CR_OFFSET              0x00         /**< \brief (IISC_CR offset) Control Register */

#define IISC_CR_RXEN_Pos            0            /**< \brief (IISC_CR) Receive Enable */
#define IISC_CR_RXEN                (_U(0x1) << IISC_CR_RXEN_Pos)
#define   IISC_CR_RXEN_OFF_Val            _U(0x0)   /**< \brief (IISC_CR) No effect */
#define   IISC_CR_RXEN_ON_Val             _U(0x1)   /**< \brief (IISC_CR) Enables Data Receive if RXDIS is not set */
#define IISC_CR_RXEN_OFF            (IISC_CR_RXEN_OFF_Val          << IISC_CR_RXEN_Pos)
#define IISC_CR_RXEN_ON             (IISC_CR_RXEN_ON_Val           << IISC_CR_RXEN_Pos)
#define IISC_CR_RXDIS_Pos           1            /**< \brief (IISC_CR) Receive Disable */
#define IISC_CR_RXDIS               (_U(0x1) << IISC_CR_RXDIS_Pos)
#define   IISC_CR_RXDIS_OFF_Val           _U(0x0)   /**< \brief (IISC_CR) No effect */
#define   IISC_CR_RXDIS_ON_Val            _U(0x1)   /**< \brief (IISC_CR) Disables Data Receive */
#define IISC_CR_RXDIS_OFF           (IISC_CR_RXDIS_OFF_Val         << IISC_CR_RXDIS_Pos)
#define IISC_CR_RXDIS_ON            (IISC_CR_RXDIS_ON_Val          << IISC_CR_RXDIS_Pos)
#define IISC_CR_CKEN_Pos            2            /**< \brief (IISC_CR) Clocks Enable */
#define IISC_CR_CKEN                (_U(0x1) << IISC_CR_CKEN_Pos)
#define   IISC_CR_CKEN_OFF_Val            _U(0x0)   /**< \brief (IISC_CR) No effect */
#define   IISC_CR_CKEN_ON_Val             _U(0x1)   /**< \brief (IISC_CR) Enables clocks if CKDIS is not set */
#define IISC_CR_CKEN_OFF            (IISC_CR_CKEN_OFF_Val          << IISC_CR_CKEN_Pos)
#define IISC_CR_CKEN_ON             (IISC_CR_CKEN_ON_Val           << IISC_CR_CKEN_Pos)
#define IISC_CR_CKDIS_Pos           3            /**< \brief (IISC_CR) Clocks Disable */
#define IISC_CR_CKDIS               (_U(0x1) << IISC_CR_CKDIS_Pos)
#define   IISC_CR_CKDIS_OFF_Val           _U(0x0)   /**< \brief (IISC_CR) No effect */
#define   IISC_CR_CKDIS_ON_Val            _U(0x1)   /**< \brief (IISC_CR) Disables clocks */
#define IISC_CR_CKDIS_OFF           (IISC_CR_CKDIS_OFF_Val         << IISC_CR_CKDIS_Pos)
#define IISC_CR_CKDIS_ON            (IISC_CR_CKDIS_ON_Val          << IISC_CR_CKDIS_Pos)
#define IISC_CR_TXEN_Pos            4            /**< \brief (IISC_CR) Transmit Enable */
#define IISC_CR_TXEN                (_U(0x1) << IISC_CR_TXEN_Pos)
#define   IISC_CR_TXEN_OFF_Val            _U(0x0)   /**< \brief (IISC_CR) No effect */
#define   IISC_CR_TXEN_ON_Val             _U(0x1)   /**< \brief (IISC_CR) Enables Data Transmit if TXDIS is not set */
#define IISC_CR_TXEN_OFF            (IISC_CR_TXEN_OFF_Val          << IISC_CR_TXEN_Pos)
#define IISC_CR_TXEN_ON             (IISC_CR_TXEN_ON_Val           << IISC_CR_TXEN_Pos)
#define IISC_CR_TXDIS_Pos           5            /**< \brief (IISC_CR) Transmit Disable */
#define IISC_CR_TXDIS               (_U(0x1) << IISC_CR_TXDIS_Pos)
#define   IISC_CR_TXDIS_OFF_Val           _U(0x0)   /**< \brief (IISC_CR) No effect */
#define   IISC_CR_TXDIS_ON_Val            _U(0x1)   /**< \brief (IISC_CR) Disables Data Transmit */
#define IISC_CR_TXDIS_OFF           (IISC_CR_TXDIS_OFF_Val         << IISC_CR_TXDIS_Pos)
#define IISC_CR_TXDIS_ON            (IISC_CR_TXDIS_ON_Val          << IISC_CR_TXDIS_Pos)
#define IISC_CR_SWRST_Pos           7            /**< \brief (IISC_CR) Software Reset */
#define IISC_CR_SWRST               (_U(0x1) << IISC_CR_SWRST_Pos)
#define   IISC_CR_SWRST_OFF_Val           _U(0x0)   /**< \brief (IISC_CR) No effect */
#define   IISC_CR_SWRST_ON_Val            _U(0x1)   /**< \brief (IISC_CR) Performs a software reset. Has priority on any other bit in CR */
#define IISC_CR_SWRST_OFF           (IISC_CR_SWRST_OFF_Val         << IISC_CR_SWRST_Pos)
#define IISC_CR_SWRST_ON            (IISC_CR_SWRST_ON_Val          << IISC_CR_SWRST_Pos)
#define IISC_CR_MASK                _U(0x000000BF) /**< \brief (IISC_CR) MASK Register */

