frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l8/include/component/iisc.h
#define IISC_SR_RXEN_Pos            0            /**< \brief (IISC_SR) Receive Enable */
#define IISC_SR_RXEN                (_U(0x1) << IISC_SR_RXEN_Pos)
#define   IISC_SR_RXEN_OFF_Val            _U(0x0)   /**< \brief (IISC_SR) Receiver is effectively disabled, following a CR.RXDIS or CR.SWRST request */
#define   IISC_SR_RXEN_ON_Val             _U(0x1)   /**< \brief (IISC_SR) Receiver is effectively enabled, following a CR.RXEN request */
#define IISC_SR_RXEN_OFF            (IISC_SR_RXEN_OFF_Val          << IISC_SR_RXEN_Pos)
#define IISC_SR_RXEN_ON             (IISC_SR_RXEN_ON_Val           << IISC_SR_RXEN_Pos)
#define IISC_SR_RXRDY_Pos           1            /**< \brief (IISC_SR) Receive Ready */
#define IISC_SR_RXRDY               (_U(0x1) << IISC_SR_RXRDY_Pos)
#define   IISC_SR_RXRDY_EMPTY_Val         _U(0x0)   /**< \brief (IISC_SR) The register RHR is empty and can't be read */
#define   IISC_SR_RXRDY_FULL_Val          _U(0x1)   /**< \brief (IISC_SR) The register RHR is full and is ready to be read */
#define IISC_SR_RXRDY_EMPTY         (IISC_SR_RXRDY_EMPTY_Val       << IISC_SR_RXRDY_Pos)
#define IISC_SR_RXRDY_FULL          (IISC_SR_RXRDY_FULL_Val        << IISC_SR_RXRDY_Pos)
#define IISC_SR_RXOR_Pos            2            /**< \brief (IISC_SR) Receive Overrun */
#define IISC_SR_RXOR                (_U(0x1) << IISC_SR_RXOR_Pos)
#define   IISC_SR_RXOR_NO_Val             _U(0x0)   /**< \brief (IISC_SR) No overrun */
#define   IISC_SR_RXOR_YES_Val            _U(0x1)   /**< \brief (IISC_SR) The previous received data has not been read. This data is lost */
#define IISC_SR_RXOR_NO             (IISC_SR_RXOR_NO_Val           << IISC_SR_RXOR_Pos)
#define IISC_SR_RXOR_YES            (IISC_SR_RXOR_YES_Val          << IISC_SR_RXOR_Pos)
#define IISC_SR_TXEN_Pos            4            /**< \brief (IISC_SR) Transmit Enable */
#define IISC_SR_TXEN                (_U(0x1) << IISC_SR_TXEN_Pos)
#define   IISC_SR_TXEN_OFF_Val            _U(0x0)   /**< \brief (IISC_SR) Transmitter is effectively disabled, following a CR.TXDIS or CR.SWRST request */
#define   IISC_SR_TXEN_ON_Val             _U(0x1)   /**< \brief (IISC_SR) Transmitter is effectively enabled, following a CR.TXEN request */
#define IISC_SR_TXEN_OFF            (IISC_SR_TXEN_OFF_Val          << IISC_SR_TXEN_Pos)
#define IISC_SR_TXEN_ON             (IISC_SR_TXEN_ON_Val           << IISC_SR_TXEN_Pos)
#define IISC_SR_TXRDY_Pos           5            /**< \brief (IISC_SR) Transmit Ready */
#define IISC_SR_TXRDY               (_U(0x1) << IISC_SR_TXRDY_Pos)
#define   IISC_SR_TXRDY_FULL_Val          _U(0x0)   /**< \brief (IISC_SR) The register THR is full and can't be written */
#define   IISC_SR_TXRDY_EMPTY_Val         _U(0x1)   /**< \brief (IISC_SR) The register THR is empty and is ready to be written */
#define IISC_SR_TXRDY_FULL          (IISC_SR_TXRDY_FULL_Val        << IISC_SR_TXRDY_Pos)
#define IISC_SR_TXRDY_EMPTY         (IISC_SR_TXRDY_EMPTY_Val       << IISC_SR_TXRDY_Pos)
#define IISC_SR_TXUR_Pos            6            /**< \brief (IISC_SR) Transmit Underrun */
#define IISC_SR_TXUR                (_U(0x1) << IISC_SR_TXUR_Pos)
#define   IISC_SR_TXUR_NO_Val             _U(0x0)   /**< \brief (IISC_SR) No underrun */
#define   IISC_SR_TXUR_YES_Val            _U(0x1)   /**< \brief (IISC_SR) The last bit of the last data written to the register THR has been set. Until the next write to THR, data will be sent according to MR.TXSAME field */
#define IISC_SR_TXUR_NO             (IISC_SR_TXUR_NO_Val           << IISC_SR_TXUR_Pos)
#define IISC_SR_TXUR_YES            (IISC_SR_TXUR_YES_Val          << IISC_SR_TXUR_Pos)
#define IISC_SR_RXORCH_Pos          8            /**< \brief (IISC_SR) Receive Overrun Channels */
#define IISC_SR_RXORCH_Msk          (_U(0x3) << IISC_SR_RXORCH_Pos)
#define IISC_SR_RXORCH(value)       (IISC_SR_RXORCH_Msk & ((value) << IISC_SR_RXORCH_Pos))
#define   IISC_SR_RXORCH_LEFT_Val         _U(0x0)   /**< \brief (IISC_SR) Overrun first occurred on left channel */
#define   IISC_SR_RXORCH_RIGHT_Val        _U(0x1)   /**< \brief (IISC_SR) Overrun first occurred on right channel */
#define IISC_SR_RXORCH_LEFT         (IISC_SR_RXORCH_LEFT_Val       << IISC_SR_RXORCH_Pos)
#define IISC_SR_RXORCH_RIGHT        (IISC_SR_RXORCH_RIGHT_Val      << IISC_SR_RXORCH_Pos)
#define IISC_SR_TXURCH_Pos          20           /**< \brief (IISC_SR) Transmit Underrun Channels */
#define IISC_SR_TXURCH_Msk          (_U(0x3) << IISC_SR_TXURCH_Pos)
#define IISC_SR_TXURCH(value)       (IISC_SR_TXURCH_Msk & ((value) << IISC_SR_TXURCH_Pos))
#define   IISC_SR_TXURCH_LEFT_Val         _U(0x0)   /**< \brief (IISC_SR) Underrun first occurred on left channel */
#define   IISC_SR_TXURCH_RIGHT_Val        _U(0x1)   /**< \brief (IISC_SR) Underrun first occurred on right channel */
#define IISC_SR_TXURCH_LEFT         (IISC_SR_TXURCH_LEFT_Val       << IISC_SR_TXURCH_Pos)
#define IISC_SR_TXURCH_RIGHT        (IISC_SR_TXURCH_RIGHT_Val      << IISC_SR_TXURCH_Pos)
#define IISC_SR_MASK                _U(0x00300377) /**< \brief (IISC_SR) MASK Register */

/* -------- IISC_SCR : (IISC Offset: 0x0C) ( /W 32) Status Clear Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t :2;               /*!< bit:  0.. 1  Reserved                           */
    uint32_t RXOR:1;           /*!< bit:      2  Receive Overrun                    */
    uint32_t :3;               /*!< bit:  3.. 5  Reserved                           */
    uint32_t TXUR:1;           /*!< bit:      6  Transmit Underrun                  */
    uint32_t :1;               /*!< bit:      7  Reserved                           */
    uint32_t RXORCH:2;         /*!< bit:  8.. 9  Receive Overrun Channels           */
    uint32_t :10;              /*!< bit: 10..19  Reserved                           */
    uint32_t TXURCH:2;         /*!< bit: 20..21  Transmit Underrun Channels         */
    uint32_t :10;              /*!< bit: 22..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} IISC_SCR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

