frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l8/include/component/iisc.h
#define IISC_IER_RXRDY_Pos          1            /**< \brief (IISC_IER) Receiver Ready Interrupt Enable */
#define IISC_IER_RXRDY              (_U(0x1) << IISC_IER_RXRDY_Pos)
#define   IISC_IER_RXRDY_OFF_Val          _U(0x0)   /**< \brief (IISC_IER) No effect */
#define   IISC_IER_RXRDY_ON_Val           _U(0x1)   /**< \brief (IISC_IER) Enables the corresponding interrupt */
#define IISC_IER_RXRDY_OFF          (IISC_IER_RXRDY_OFF_Val        << IISC_IER_RXRDY_Pos)
#define IISC_IER_RXRDY_ON           (IISC_IER_RXRDY_ON_Val         << IISC_IER_RXRDY_Pos)
#define IISC_IER_RXOR_Pos           2            /**< \brief (IISC_IER) Receive Overrun Interrupt Enable */
#define IISC_IER_RXOR               (_U(0x1) << IISC_IER_RXOR_Pos)
#define   IISC_IER_RXOR_OFF_Val           _U(0x0)   /**< \brief (IISC_IER) No effect */
#define   IISC_IER_RXOR_ON_Val            _U(0x1)   /**< \brief (IISC_IER) Enables the corresponding interrupt */
#define IISC_IER_RXOR_OFF           (IISC_IER_RXOR_OFF_Val         << IISC_IER_RXOR_Pos)
#define IISC_IER_RXOR_ON            (IISC_IER_RXOR_ON_Val          << IISC_IER_RXOR_Pos)
#define IISC_IER_TXRDY_Pos          5            /**< \brief (IISC_IER) Transmit Ready Interrupt Enable */
#define IISC_IER_TXRDY              (_U(0x1) << IISC_IER_TXRDY_Pos)
#define   IISC_IER_TXRDY_OFF_Val          _U(0x0)   /**< \brief (IISC_IER) No effect */
#define   IISC_IER_TXRDY_ON_Val           _U(0x1)   /**< \brief (IISC_IER) Enables the corresponding interrupt */
#define IISC_IER_TXRDY_OFF          (IISC_IER_TXRDY_OFF_Val        << IISC_IER_TXRDY_Pos)
#define IISC_IER_TXRDY_ON           (IISC_IER_TXRDY_ON_Val         << IISC_IER_TXRDY_Pos)
#define IISC_IER_TXUR_Pos           6            /**< \brief (IISC_IER) Transmit Underrun Interrupt Enable */
#define IISC_IER_TXUR               (_U(0x1) << IISC_IER_TXUR_Pos)
#define   IISC_IER_TXUR_OFF_Val           _U(0x0)   /**< \brief (IISC_IER) No effect */
#define   IISC_IER_TXUR_ON_Val            _U(0x1)   /**< \brief (IISC_IER) Enables the corresponding interrupt */
#define IISC_IER_TXUR_OFF           (IISC_IER_TXUR_OFF_Val         << IISC_IER_TXUR_Pos)
#define IISC_IER_TXUR_ON            (IISC_IER_TXUR_ON_Val          << IISC_IER_TXUR_Pos)
#define IISC_IER_MASK               _U(0x00000066) /**< \brief (IISC_IER) MASK Register */

/* -------- IISC_IDR : (IISC Offset: 0x18) ( /W 32) Interrupt Disable Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t :1;               /*!< bit:      0  Reserved                           */
    uint32_t RXRDY:1;          /*!< bit:      1  Receive Ready Interrupt Disable    */
    uint32_t RXOR:1;           /*!< bit:      2  Receive Overrun Interrupt Disable  */
    uint32_t :2;               /*!< bit:  3.. 4  Reserved                           */
    uint32_t TXRDY:1;          /*!< bit:      5  Transmit Ready Interrupt Disable   */
    uint32_t TXUR:1;           /*!< bit:      6  Transmit Underrun Interrupt Disable */
    uint32_t :25;              /*!< bit:  7..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} IISC_IDR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define IISC_IDR_OFFSET             0x18         /**< \brief (IISC_IDR offset) Interrupt Disable Register */

#define IISC_IDR_RXRDY_Pos          1            /**< \brief (IISC_IDR) Receive Ready Interrupt Disable */
#define IISC_IDR_RXRDY              (_U(0x1) << IISC_IDR_RXRDY_Pos)
#define   IISC_IDR_RXRDY_OFF_Val          _U(0x0)   /**< \brief (IISC_IDR) No effect */
#define   IISC_IDR_RXRDY_ON_Val           _U(0x1)   /**< \brief (IISC_IDR) Disables the corresponding interrupt */
#define IISC_IDR_RXRDY_OFF          (IISC_IDR_RXRDY_OFF_Val        << IISC_IDR_RXRDY_Pos)
#define IISC_IDR_RXRDY_ON           (IISC_IDR_RXRDY_ON_Val         << IISC_IDR_RXRDY_Pos)
#define IISC_IDR_RXOR_Pos           2            /**< \brief (IISC_IDR) Receive Overrun Interrupt Disable */
#define IISC_IDR_RXOR               (_U(0x1) << IISC_IDR_RXOR_Pos)
#define   IISC_IDR_RXOR_OFF_Val           _U(0x0)   /**< \brief (IISC_IDR) No effect */
#define   IISC_IDR_RXOR_ON_Val            _U(0x1)   /**< \brief (IISC_IDR) Disables the corresponding interrupt */
#define IISC_IDR_RXOR_OFF           (IISC_IDR_RXOR_OFF_Val         << IISC_IDR_RXOR_Pos)
#define IISC_IDR_RXOR_ON            (IISC_IDR_RXOR_ON_Val          << IISC_IDR_RXOR_Pos)
#define IISC_IDR_TXRDY_Pos          5            /**< \brief (IISC_IDR) Transmit Ready Interrupt Disable */
#define IISC_IDR_TXRDY              (_U(0x1) << IISC_IDR_TXRDY_Pos)
#define   IISC_IDR_TXRDY_OFF_Val          _U(0x0)   /**< \brief (IISC_IDR) No effect */
#define   IISC_IDR_TXRDY_ON_Val           _U(0x1)   /**< \brief (IISC_IDR) Disables the corresponding interrupt */
#define IISC_IDR_TXRDY_OFF          (IISC_IDR_TXRDY_OFF_Val        << IISC_IDR_TXRDY_Pos)
#define IISC_IDR_TXRDY_ON           (IISC_IDR_TXRDY_ON_Val         << IISC_IDR_TXRDY_Pos)
#define IISC_IDR_TXUR_Pos           6            /**< \brief (IISC_IDR) Transmit Underrun Interrupt Disable */
#define IISC_IDR_TXUR               (_U(0x1) << IISC_IDR_TXUR_Pos)
#define   IISC_IDR_TXUR_OFF_Val           _U(0x0)   /**< \brief (IISC_IDR) No effect */
#define   IISC_IDR_TXUR_ON_Val            _U(0x1)   /**< \brief (IISC_IDR) Disables the corresponding interrupt */
#define IISC_IDR_TXUR_OFF           (IISC_IDR_TXUR_OFF_Val         << IISC_IDR_TXUR_Pos)
#define IISC_IDR_TXUR_ON            (IISC_IDR_TXUR_ON_Val          << IISC_IDR_TXUR_Pos)
#define IISC_IDR_MASK               _U(0x00000066) /**< \brief (IISC_IDR) MASK Register */

/* -------- IISC_IMR : (IISC Offset: 0x1C) (R/  32) Interrupt Mask Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t :1;               /*!< bit:      0  Reserved                           */
    uint32_t RXRDY:1;          /*!< bit:      1  Receive Ready Interrupt Mask       */
    uint32_t RXOR:1;           /*!< bit:      2  Receive Overrun Interrupt Mask     */
    uint32_t :2;               /*!< bit:  3.. 4  Reserved                           */
    uint32_t TXRDY:1;          /*!< bit:      5  Transmit Ready Interrupt Mask      */
    uint32_t TXUR:1;           /*!< bit:      6  Transmit Underrun Interrupt Mask   */
    uint32_t :25;              /*!< bit:  7..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} IISC_IMR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

